espressif/esp-idf/components/soc/esp32s31/register/soc/axi_dma_struct.h
/** Type of out_int_clr_chn register
 *  Interrupt clear bits of channel0
 */
typedef union {
    struct {
        /** out_done_chn_int_clr : WT; bitpos: [0]; default: 0;
         *  Set this bit to clear the OUT_DONE_CH_INT interrupt.
         */
        uint32_t out_done_chn_int_clr: 1;
        /** out_eof_chn_int_clr : WT; bitpos: [1]; default: 0;
         *  Set this bit to clear the OUT_EOF_CH_INT interrupt.
         */
        uint32_t out_eof_chn_int_clr: 1;
        /** out_dscr_err_chn_int_clr : WT; bitpos: [2]; default: 0;
         *  Set this bit to clear the OUT_DSCR_ERR_CH_INT interrupt.
         */
        uint32_t out_dscr_err_chn_int_clr: 1;
        /** out_total_eof_chn_int_clr : WT; bitpos: [3]; default: 0;
         *  Set this bit to clear the OUT_TOTAL_EOF_CH_INT interrupt.
         */
        uint32_t out_total_eof_chn_int_clr: 1;
        /** outfifo_l1_ovf_chn_int_clr : WT; bitpos: [4]; default: 0;
         *  Set this bit to clear the OUTFIFO_OVF_L1_CH_INT interrupt.
         */
        uint32_t outfifo_l1_ovf_chn_int_clr: 1;
        /** outfifo_l1_udf_chn_int_clr : WT; bitpos: [5]; default: 0;
         *  Set this bit to clear the OUTFIFO_UDF_L1_CH_INT interrupt.
         */
        uint32_t outfifo_l1_udf_chn_int_clr: 1;
        /** outfifo_l2_ovf_chn_int_clr : WT; bitpos: [6]; default: 0;
         *  Set this bit to clear the OUTFIFO_OVF_L2_CH_INT interrupt.
         */
        uint32_t outfifo_l2_ovf_chn_int_clr: 1;
        /** outfifo_l2_udf_chn_int_clr : WT; bitpos: [7]; default: 0;
         *  Set this bit to clear the OUTFIFO_UDF_L2_CH_INT interrupt.
         */
        uint32_t outfifo_l2_udf_chn_int_clr: 1;
        /** outfifo_l3_ovf_chn_int_clr : WT; bitpos: [8]; default: 0;
         *  Set this bit to clear the OUTFIFO_OVF_L3_CH_INT interrupt.
         */
        uint32_t outfifo_l3_ovf_chn_int_clr: 1;
        /** outfifo_l3_udf_chn_int_clr : WT; bitpos: [9]; default: 0;
         *  Set this bit to clear the OUTFIFO_UDF_L3_CH_INT interrupt.
         */
        uint32_t outfifo_l3_udf_chn_int_clr: 1;
        /** out_link_switch_chn_int_clr : WT; bitpos: [10]; default: 0;
         *  Set this bit to clear the OUT_LINK_SWITCH_CH_INT interrupt.
         */
        uint32_t out_link_switch_chn_int_clr: 1;
        uint32_t reserved_11: 21;
    };
    uint32_t val;
} axi_dma_out_int_clr_chn_reg_t;

/** Type of out_conf0_chn register
 *  Configure 0 register of Tx channelN
 */
typedef union {
    struct {
        /** out_rst_chn : R/W; bitpos: [0]; default: 0;
         *  This bit is used to reset AXI_DMA channel0 Tx FSM and Tx FIFO pointer.
         */
        uint32_t out_rst_chn: 1;
        /** out_loop_test_chn : R/W; bitpos: [1]; default: 0;
         *  reserved
         */
        uint32_t out_loop_test_chn: 1;
        /** out_auto_wrback_chn : R/W; bitpos: [2]; default: 0;
         *  Set this bit to enable automatic outlink-writeback when all the data in tx buffer
         *  has been transmitted.
         */
        uint32_t out_auto_wrback_chn: 1;
        /** out_eof_mode_chn : R/W; bitpos: [3]; default: 1;
         *  EOF flag generation mode when transmitting data. 1: EOF flag for Tx channel0 is
         *  generated when data need to transmit has been popped from FIFO in AXI_DMA
         */
        uint32_t out_eof_mode_chn: 1;
        /** out_etm_en_chn : R/W; bitpos: [4]; default: 0;
         *  Set this bit to 1 to enable etm control mode, dma Tx channel0 is triggered by etm
         *  task.
         */
        uint32_t out_etm_en_chn: 1;
        /** out_burst_size_sel_chn : R/W; bitpos: [7:5]; default: 0;
         *  3'b000-3'b100:burst length 8byte~128byte
         */
        uint32_t out_burst_size_sel_chn: 3;
        /** out_cmd_disable_chn : R/W; bitpos: [8]; default: 0;
         *  1:mean disable cmd of this chn
         */
        uint32_t out_cmd_disable_chn: 1;
        /** out_ecc_aes_en_chn : R/W; bitpos: [9]; default: 0;
         *  1: mean access ecc or aes domain,0: mean not
         */
        uint32_t out_ecc_aes_en_chn: 1;
        /** outdscr_burst_en_chn : R/W; bitpos: [10]; default: 0;
         *  Set this bit to 1 to enable INCR burst transfer for Tx channel0 reading link
         *  descriptor when accessing internal SRAM.
         */
        uint32_t outdscr_burst_en_chn: 1;
        uint32_t reserved_11: 21;
    };
    uint32_t val;
} axi_dma_out_conf0_chn_reg_t;

/** Type of out_conf1_chn register
 *  Configure 1 register of Tx channel0
 */
typedef union {
    struct {
        uint32_t reserved_0: 12;
        /** out_check_owner_chn : R/W; bitpos: [12]; default: 0;
         *  Set this bit to enable checking the owner attribute of the link descriptor.
         */
        uint32_t out_check_owner_chn: 1;
        uint32_t reserved_13: 19;
    };
    uint32_t val;
} axi_dma_out_conf1_chn_reg_t;

/** Type of outfifo_status_chn register
 *  Transmit FIFO status of Tx channel0
 */
typedef union {
    struct {
        /** outfifo_l3_full_chn : RO; bitpos: [0]; default: 0;
         *  L3 Tx FIFO full signal for Tx channel0.
         */
        uint32_t outfifo_l3_full_chn: 1;
        /** outfifo_l3_empty_chn : RO; bitpos: [1]; default: 1;
         *  L3 Tx FIFO empty signal for Tx channel0.
         */
        uint32_t outfifo_l3_empty_chn: 1;
        /** outfifo_l3_cnt_chn : RO; bitpos: [7:2]; default: 0;
         *  The register stores the byte number of the data in L3 Tx FIFO for Tx channel0.
         */
        uint32_t outfifo_l3_cnt_chn: 6;
        /** outfifo_l3_udf_chn : RO; bitpos: [8]; default: 0;
         *  L3 Tx FIFO under flow signal for Tx channel0.
         */
        uint32_t outfifo_l3_udf_chn: 1;
        /** outfifo_l3_ovf_chn : RO; bitpos: [9]; default: 0;
         *  L3 Tx FIFO over flow signal for Tx channel0.
         */
        uint32_t outfifo_l3_ovf_chn: 1;
        /** outfifo_l1_full_chn : RO; bitpos: [10]; default: 0;
         *  L1 Tx FIFO full signal for Tx channel0.
         */
        uint32_t outfifo_l1_full_chn: 1;
        /** outfifo_l1_empty_chn : RO; bitpos: [11]; default: 1;
         *  L1 Tx FIFO empty signal for Tx channel0.
         */
        uint32_t outfifo_l1_empty_chn: 1;
        /** outfifo_l1_udf_chn : RO; bitpos: [12]; default: 0;
         *  L1 Tx FIFO under flow signal for Tx channel0.
         */
        uint32_t outfifo_l1_udf_chn: 1;
        /** outfifo_l1_ovf_chn : RO; bitpos: [13]; default: 0;
         *  L1 Tx FIFO over flow signal for Tx channel0.
         */
        uint32_t outfifo_l1_ovf_chn: 1;
        /** outfifo_l2_full_chn : RO; bitpos: [14]; default: 0;
         *  L2 Tx RAM full signal for Tx channel0.
         */
        uint32_t outfifo_l2_full_chn: 1;
        /** outfifo_l2_empty_chn : RO; bitpos: [15]; default: 1;
         *  L2 Tx RAM empty signal for Tx channel0.
         */
        uint32_t outfifo_l2_empty_chn: 1;
        /** outfifo_l2_udf_chn : RO; bitpos: [16]; default: 0;
         *  L2 Tx FIFO under flow signal for Tx channel0.
         */
        uint32_t outfifo_l2_udf_chn: 1;
        /** outfifo_l2_ovf_chn : RO; bitpos: [17]; default: 0;
         *  L2 Tx FIFO over flow signal for Tx channel0.
         */
        uint32_t outfifo_l2_ovf_chn: 1;
        uint32_t reserved_18: 5;
        /** out_remain_under_1b_chn : RO; bitpos: [23]; default: 1;
         *  reserved
         */
        uint32_t out_remain_under_1b_chn: 1;
        /** out_remain_under_2b_chn : RO; bitpos: [24]; default: 1;
         *  reserved
         */
        uint32_t out_remain_under_2b_chn: 1;
        /** out_remain_under_3b_chn : RO; bitpos: [25]; default: 1;
         *  reserved
         */
        uint32_t out_remain_under_3b_chn: 1;
        /** out_remain_under_4b_chn : RO; bitpos: [26]; default: 1;
         *  reserved
         */
        uint32_t out_remain_under_4b_chn: 1;
        /** out_remain_under_5b_chn : RO; bitpos: [27]; default: 1;
         *  reserved
         */
        uint32_t out_remain_under_5b_chn: 1;
        /** out_remain_under_6b_chn : RO; bitpos: [28]; default: 1;
         *  reserved
         */
        uint32_t out_remain_under_6b_chn: 1;
        /** out_remain_under_7b_chn : RO; bitpos: [29]; default: 1;
         *  reserved
         */
        uint32_t out_remain_under_7b_chn: 1;
        /** out_remain_under_8b_chn : RO; bitpos: [30]; default: 1;
         *  reserved
         */
        uint32_t out_remain_under_8b_chn: 1;
        uint32_t reserved_31: 1;
    };
    uint32_t val;
} axi_dma_outfifo_status_chn_reg_t;

/** Type of out_push_chn register
 *  Push control register of Tx channel0
 */
typedef union {
    struct {
        /** outfifo_wdata_chn : R/W; bitpos: [8:0]; default: 0;
         *  This register stores the data that need to be pushed into AXI_DMA FIFO.
         */
        uint32_t outfifo_wdata_chn: 9;
        /** outfifo_push_chn : WT; bitpos: [9]; default: 0;
         *  Set this bit to push data into AXI_DMA FIFO.
         */
        uint32_t outfifo_push_chn: 1;
        uint32_t reserved_10: 22;
    };
    uint32_t val;
} axi_dma_out_push_chn_reg_t;

/** Type of out_link1_chn register
 *  Link descriptor configure and control register of Tx channel0
 */
typedef union {
    struct {
        /** outlink_stop_chn : WT; bitpos: [0]; default: 0;
         *  Set this bit to stop dealing with the outlink descriptors.
         */
        uint32_t outlink_stop_chn: 1;
        /** outlink_start_chn : WT; bitpos: [1]; default: 0;
         *  Set this bit to start dealing with the outlink descriptors.
         */
        uint32_t outlink_start_chn: 1;
        /** outlink_restart_chn : WT; bitpos: [2]; default: 0;
         *  Set this bit to restart a new outlink from the last address.
         */
        uint32_t outlink_restart_chn: 1;
        /** outlink_park_chn : RO; bitpos: [3]; default: 1;
         *  1: the outlink descriptor's FSM is in idle state.  0: the outlink descriptor's FSM
         *  is working.
         */
        uint32_t outlink_park_chn: 1;
        uint32_t reserved_4: 28;
    };
    uint32_t val;
} axi_dma_out_link1_chn_reg_t;

