espressif/esp-idf/components/soc/esp32s31/register/soc/axi_dma_struct.h
/** Type of out_link2_chn register
 *  Link descriptor configure and control register of Tx channel0
 */
typedef union {
    struct {
        /** outlink_addr_chn : R/W; bitpos: [31:0]; default: 0;
         *  This register stores the 32 least significant bits of the first outlink
         *  descriptor's address.
         */
        uint32_t outlink_addr_chn: 32;
    };
    uint32_t val;
} axi_dma_out_link2_chn_reg_t;

/** Type of out_state_chn register
 *  Transmit status of Tx channel0
 */
typedef union {
    struct {
        /** outlink_dscr_addr_chn : RO; bitpos: [17:0]; default: 0;
         *  This register stores the current outlink descriptor's address.
         */
        uint32_t outlink_dscr_addr_chn: 18;
        /** out_dscr_state_chn : RO; bitpos: [19:18]; default: 0;
         *  reserved
         */
        uint32_t out_dscr_state_chn: 2;
        /** out_state_chn : RO; bitpos: [22:20]; default: 0;
         *  reserved
         */
        uint32_t out_state_chn: 3;
        uint32_t reserved_23: 9;
    };
    uint32_t val;
} axi_dma_out_state_chn_reg_t;

/** Type of out_eof_des_addr_chn register
 *  Outlink descriptor address when EOF occurs of Tx channel0
 */
typedef union {
    struct {
        /** out_eof_des_addr_chn : RO; bitpos: [31:0]; default: 0;
         *  This register stores the address of the outlink descriptor when the EOF bit in this
         *  descriptor is 1.
         */
        uint32_t out_eof_des_addr_chn: 32;
    };
    uint32_t val;
} axi_dma_out_eof_des_addr_chn_reg_t;

/** Type of out_eof_bfr_des_addr_chn register
 *  The last outlink descriptor address when EOF occurs of Tx channel0
 */
typedef union {
    struct {
        /** out_eof_bfr_des_addr_chn : RO; bitpos: [31:0]; default: 0;
         *  This register stores the address of the outlink descriptor before the last outlink
         *  descriptor.
         */
        uint32_t out_eof_bfr_des_addr_chn: 32;
    };
    uint32_t val;
} axi_dma_out_eof_bfr_des_addr_chn_reg_t;

/** Type of out_dscr_chn register
 *  Current outlink descriptor address of Tx channel0
 */
typedef union {
    struct {
        /** outlink_dscr_chn : RO; bitpos: [31:0]; default: 0;
         *  The address of the current outlink descriptor y.
         */
        uint32_t outlink_dscr_chn: 32;
    };
    uint32_t val;
} axi_dma_out_dscr_chn_reg_t;

/** Type of out_dscr_bf0_chn register
 *  The last outlink descriptor address of Tx channel0
 */
typedef union {
    struct {
        /** outlink_dscr_bf0_chn : RO; bitpos: [31:0]; default: 0;
         *  The address of the last outlink descriptor y-1.
         */
        uint32_t outlink_dscr_bf0_chn: 32;
    };
    uint32_t val;
} axi_dma_out_dscr_bf0_chn_reg_t;

/** Type of out_dscr_bf1_chn register
 *  The second-to-last outlink descriptor address of Tx channel0
 */
typedef union {
    struct {
        /** outlink_dscr_bf1_chn : RO; bitpos: [31:0]; default: 0;
         *  The address of the second-to-last outlink descriptor x-2.
         */
        uint32_t outlink_dscr_bf1_chn: 32;
    };
    uint32_t val;
} axi_dma_out_dscr_bf1_chn_reg_t;

/** Type of out_pri_chn register
 *  Priority register of Tx channel0.
 */
typedef union {
    struct {
        /** tx_pri_chn : R/W; bitpos: [3:0]; default: 0;
         *  The priority of Tx channel0. The larger of the value the higher of the priority.
         */
        uint32_t tx_pri_chn: 4;
        /** tx_ch_arb_weigh_chn : R/W; bitpos: [7:4]; default: 0;
         *  The weight of Tx channel0
         */
        uint32_t tx_ch_arb_weigh_chn: 4;
        /** tx_arb_weigh_opt_dir_chn : R/W; bitpos: [8]; default: 0;
         *  0: mean not optimization weight function ,1: mean optimization
         */
        uint32_t tx_arb_weigh_opt_dir_chn: 1;
        uint32_t reserved_9: 23;
    };
    uint32_t val;
} axi_dma_out_pri_chn_reg_t;

/** Type of out_peri_sel_chn register
 *  Peripheral selection of Tx channel0
 */
typedef union {
    struct {
        /** peri_out_sel_chn : R/W; bitpos: [5:0]; default: 63;
         *  This register is used to select peripheral for Tx channel0. 0:lcdcam. 1: gpspi_2.
         *  2: gpspi_3. 3: parl_io. 4: aes. 5: sha. 6~15: Dummy
         */
        uint32_t peri_out_sel_chn: 6;
        uint32_t reserved_6: 26;
    };
    uint32_t val;
} axi_dma_out_peri_sel_chn_reg_t;

/** Group: Configuration Registers */
/** Type of arb_timeout register
 *  This retister is used to config arbiter time slice
 */
typedef union {
    struct {
        /** arb_timeout_tx : R/W; bitpos: [15:0]; default: 0;
         *  This register is used to config tx arbiter time out value
         */
        uint32_t arb_timeout_tx: 16;
        /** arb_timeout_rx : R/W; bitpos: [31:16]; default: 0;
         *  This register is used to config rx arbiter time out value
         */
        uint32_t arb_timeout_rx: 16;
    };
    uint32_t val;
} axi_dma_arb_timeout_reg_t;

/** Type of weight_en register
 *  This register is used to config arbiter weight function to on or off
 */
typedef union {
    struct {
        /** weight_en_tx : R/W; bitpos: [0]; default: 0;
         *  This register is used to config tx arbiter weight function  off/on
         */
        uint32_t weight_en_tx: 1;
        /** weight_en_rx : R/W; bitpos: [1]; default: 0;
         *  This register is used to config rx arbiter weight function  off/on
         */
        uint32_t weight_en_rx: 1;
        uint32_t reserved_2: 30;
    };
    uint32_t val;
} axi_dma_weight_en_reg_t;

/** Type of in_mem_conf register
 *  Mem power configure register of Rx channel
 */
typedef union {
    struct {
        /** in_mem_clk_force_en : R/W; bitpos: [0]; default: 0;
         *  1: Force to open the clock and bypass the gate-clock when accessing the RAM in
         *  AXI_DMA. 0: A gate-clock will be used when accessing the RAM in AXI_DMA.
         */
        uint32_t in_mem_clk_force_en: 1;
        /** in_mem_force_pu : R/W; bitpos: [1]; default: 0;
         *  Force power up ram
         */
        uint32_t in_mem_force_pu: 1;
        /** in_mem_force_pd : R/W; bitpos: [2]; default: 0;
         *  Force power down ram
         */
        uint32_t in_mem_force_pd: 1;
        /** out_mem_clk_force_en : R/W; bitpos: [3]; default: 0;
         *  1: Force to open the clock and bypass the gate-clock when accessing the RAM in
         *  AXI_DMA. 0: A gate-clock will be used when accessing the RAM in AXI_DMA.
         */
        uint32_t out_mem_clk_force_en: 1;
        /** out_mem_force_pu : R/W; bitpos: [4]; default: 0;
         *  Force power up ram
         */
        uint32_t out_mem_force_pu: 1;
        /** out_mem_force_pd : R/W; bitpos: [5]; default: 0;
         *  Force power down ram
         */
        uint32_t out_mem_force_pd: 1;
        uint32_t reserved_6: 26;
    };
    uint32_t val;
} axi_dma_in_mem_conf_reg_t;

