espressif/esp-idf/components/soc/esp32s31/register/soc/axi_dma_struct.h
/** Group: Version Registers */
/** Type of date register
 *  Version control register
 */
typedef union {
    struct {
        /** date : R/W; bitpos: [31:0]; default: 36712768;
         *  register version.
         */
        uint32_t date: 32;
    };
    uint32_t val;
} axi_dma_date_reg_t;

/** Type of link_switch_state register
 *  Version control register
 */
typedef union {
    struct {
        /** link_switch_state_ch0 : R/W; bitpos: [0]; default: 0;
         *  The register that confirm ch dscr switch success
         */
        uint32_t link_switch_state_ch0:1;
        /** link_switch_state_ch1 : R/W; bitpos: [1]; default: 0;
         *  The register that confirm ch dscr switch success
         */
        uint32_t link_switch_state_ch1:1;
        /** link_switch_state_ch2 : R/W; bitpos: [2]; default: 0;
         *  The register that confirm ch dscr switch success
         */
        uint32_t link_switch_state_ch2:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} axi_dma_link_switch_state_reg_t;

typedef struct {
    volatile axi_dma_in_int_raw_chn_reg_t raw;
    volatile axi_dma_in_int_st_chn_reg_t st;
    volatile axi_dma_in_int_ena_chn_reg_t ena;
    volatile axi_dma_in_int_clr_chn_reg_t clr;
} axi_dma_in_int_chn_reg_t;

typedef struct {
    volatile axi_dma_in_conf0_chn_reg_t in_conf0;
    volatile axi_dma_in_conf1_chn_reg_t in_conf1;
    volatile axi_dma_infifo_status_chn_reg_t infifo_status;
    volatile axi_dma_in_pop_chn_reg_t in_pop;
    volatile axi_dma_in_link1_chn_reg_t in_link1;
    volatile axi_dma_in_link2_chn_reg_t in_link2;
    volatile axi_dma_in_state_chn_reg_t in_state;
    volatile axi_dma_in_suc_eof_des_addr_chn_reg_t in_suc_eof_des_addr;
    volatile axi_dma_in_err_eof_des_addr_chn_reg_t in_err_eof_des_addr;
    volatile axi_dma_in_dscr_chn_reg_t in_dscr;
    volatile axi_dma_in_dscr_bf0_chn_reg_t in_dscr_bf0;
    volatile axi_dma_in_dscr_bf1_chn_reg_t in_dscr_bf1;
    volatile axi_dma_in_pri_chn_reg_t in_pri;
    volatile axi_dma_in_peri_sel_chn_reg_t in_peri_sel;
} axi_dma_in_conf_chn_reg_t;

typedef struct {
    volatile axi_dma_in_int_chn_reg_t intr;
    volatile axi_dma_in_conf_chn_reg_t conf;
    uint32_t reserved[8];
} axi_dma_in_reg_t;

typedef struct {
    volatile axi_dma_out_int_raw_chn_reg_t raw;
    volatile axi_dma_out_int_st_chn_reg_t st;
    volatile axi_dma_out_int_ena_chn_reg_t ena;
    volatile axi_dma_out_int_clr_chn_reg_t clr;
} axi_dma_out_int_chn_reg_t;

typedef struct {
    volatile axi_dma_out_conf0_chn_reg_t out_conf0;
    volatile axi_dma_out_conf1_chn_reg_t out_conf1;
    volatile axi_dma_outfifo_status_chn_reg_t outfifo_status;
    volatile axi_dma_out_push_chn_reg_t out_push;
    volatile axi_dma_out_link1_chn_reg_t out_link1;
    volatile axi_dma_out_link2_chn_reg_t out_link2;
    volatile axi_dma_out_state_chn_reg_t out_state;
    volatile axi_dma_out_eof_des_addr_chn_reg_t out_eof_des_addr;
    volatile axi_dma_out_eof_bfr_des_addr_chn_reg_t out_eof_bfr_des_addr;
    volatile axi_dma_out_dscr_chn_reg_t out_dscr;
    volatile axi_dma_out_dscr_bf0_chn_reg_t out_dscr_bf0;
    volatile axi_dma_out_dscr_bf1_chn_reg_t out_dscr_bf1;
    volatile axi_dma_out_pri_chn_reg_t out_pri;
    volatile axi_dma_out_peri_sel_chn_reg_t out_peri_sel;
} axi_dma_out_conf_chn_reg_t;

typedef struct {
    volatile axi_dma_out_int_chn_reg_t intr;
    volatile axi_dma_out_conf_chn_reg_t conf;
    uint32_t reserved[8];
} axi_dma_out_reg_t;

typedef struct {
    volatile axi_dma_in_reg_t in[3];
    volatile axi_dma_out_reg_t out[3];
    volatile axi_dma_arb_timeout_reg_t arb_timeout;
    volatile axi_dma_weight_en_reg_t weight_en;
    volatile axi_dma_in_mem_conf_reg_t in_mem_conf;
    volatile axi_dma_intr_mem_start_addr_reg_t intr_mem_start_addr;
    volatile axi_dma_intr_mem_end_addr_reg_t intr_mem_end_addr;
    volatile axi_dma_extr_mem_start_addr_reg_t extr_mem_start_addr;
    volatile axi_dma_extr_mem_end_addr_reg_t extr_mem_end_addr;
    volatile axi_dma_in_reset_avail_chn_reg_t in_reset_avail_chn[3];
    volatile axi_dma_out_reset_avail_chn_reg_t out_reset_avail_chn[3];
    uint32_t reserved_2a4;
    volatile axi_dma_misc_conf_reg_t misc_conf;
    volatile axi_dma_rdn_result_reg_t rdn_result;
    volatile axi_dma_rdn_eco_high_reg_t rdn_eco_high;
    volatile axi_dma_rdn_eco_low_reg_t rdn_eco_low;
    volatile axi_dma_wresp_cnt_reg_t wresp_cnt;
    volatile axi_dma_rresp_cnt_reg_t rresp_cnt;
    volatile axi_dma_infifo_status1_chn_reg_t infifo_status1_chn[3];
    volatile axi_dma_outfifo_status1_chn_reg_t outfifo_status1_chn[3];
    volatile axi_dma_date_reg_t date;
    volatile axi_dma_link_switch_state_reg_t link_switch_state;
} axi_dma_dev_t;

extern axi_dma_dev_t AXI_DMA;

#ifndef __cplusplus
_Static_assert(sizeof(axi_dma_dev_t) == 0x2e0, "Invalid size of axi_dma_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
